In [2]:
import numpy as np
import pandas as pd

In [3]:
data_dict1 = {'Name':['Ibrahim Musa', 'Emeka Jude','Emmanuel Ayomide'],
             'Age':[24,25,27],
             'Sport':['Football','Basketball','Volleyball']}

In [20]:
data_dict2 = {'Name':['Nnamdi Ike', 'Emmanuel Ayomide','Ahmed Musa'],
             'Age':[24,27,28],
             'Sport':['Football','Volleyball','Swimming']}

In [21]:
df1 = pd.DataFrame(data_dict1, index =[0,1,2])

In [22]:
df1

               Name  Age       Sport
0      Ibrahim Musa   24    Football
1        Emeka Jude   25  Basketball
2  Emmanuel Ayomide   27  Volleyball

In [23]:
df2 = pd.DataFrame(data_dict2, index = [3,2,5])

In [24]:
df2

               Name  Age       Sport
3        Nnamdi Ike   24    Football
2  Emmanuel Ayomide   27  Volleyball
5        Ahmed Musa   28    Swimming

In [25]:
pd.concat([df1,df2])

               Name  Age       Sport
0      Ibrahim Musa   24    Football
1        Emeka Jude   25  Basketball
2  Emmanuel Ayomide   27  Volleyball
3        Nnamdi Ike   24    Football
2  Emmanuel Ayomide   27  Volleyball
5        Ahmed Musa   28    Swimming

In [29]:
pd.concat([df1,df2], axis =1)

               Name   Age       Sport              Name   Age       Sport
0      Ibrahim Musa  24.0    Football               NaN   NaN         NaN
1        Emeka Jude  25.0  Basketball               NaN   NaN         NaN
2  Emmanuel Ayomide  27.0  Volleyball  Emmanuel Ayomide  27.0  Volleyball
3               NaN   NaN         NaN        Nnamdi Ike  24.0    Football
5               NaN   NaN         NaN        Ahmed Musa  28.0    Swimming

In [32]:
pd.concat([df1,df2], axis = 1, join = 'inner')

               Name  Age       Sport              Name  Age       Sport
2  Emmanuel Ayomide   27  Volleyball  Emmanuel Ayomide   27  Volleyball

In [35]:
dfff = pd.concat([df1,df2], keys = ['x','y'])

In [36]:
dfff

                 Name  Age       Sport
x 0      Ibrahim Musa   24    Football
  1        Emeka Jude   25  Basketball
  2  Emmanuel Ayomide   27  Volleyball
y 3        Nnamdi Ike   24    Football
  2  Emmanuel Ayomide   27  Volleyball
  5        Ahmed Musa   28    Swimming

In [37]:
details1 = {'Key 1':['K0', 'K1','K2', 'K3'],
             'Key 2':['K0','K1','K0','K1'],
            'Course':['Ibrahim Musa','Emeka Jude','Emmanuel Ayomide','Nnamdi Ike'],
             'Age ':[24,25,27,24]}

In [39]:
details1

{'Key 1': ['K0', 'K1', 'K2', 'K3'],
 'Key 2': ['K0', 'K1', 'K0', 'K1'],
 'Course': ['Ibrahim Musa', 'Emeka Jude', 'Emmanuel Ayomide', 'Nnamdi Ike'],
 'Age ': [24, 25, 27, 24]}

In [43]:
zee= pd.DataFrame(details1)

In [44]:
zee

  Key 1 Key 2            Course  Age
0    K0    K0      Ibrahim Musa    24
1    K1    K1        Emeka Jude    25
2    K2    K0  Emmanuel Ayomide    27
3    K3    K1        Nnamdi Ike    24

In [47]:
details2 = {'Key 1':['K0', 'K1','K2', 'K3'],
             'Key 2':['K0','K0','K0','K0'],
            'Course':['Physics','Statistics','Mathematics','Chemistry'],
             'Sport ':['Football','Volleyball','Swimming','BasketBall']}

In [48]:
details2

{'Key 1': ['K0', 'K1', 'K2', 'K3'],
 'Key 2': ['K0', 'K0', 'K0', 'K0'],
 'Course': ['Physics', 'Statistics', 'Mathematics', 'Chemistry'],
 'Sport ': ['Football', 'Volleyball', 'Swimming', 'BasketBall']}

In [51]:
df1 = pd.DataFrame(details1)

In [52]:
df2 = pd.DataFrame(details2)

In [53]:
df1

  Key 1 Key 2            Course  Age
0    K0    K0      Ibrahim Musa    24
1    K1    K1        Emeka Jude    25
2    K2    K0  Emmanuel Ayomide    27
3    K3    K1        Nnamdi Ike    24

In [54]:
df2

  Key 1 Key 2       Course      Sport
0    K0    K0      Physics    Football
1    K1    K0   Statistics  Volleyball
2    K2    K0  Mathematics    Swimming
3    K3    K0    Chemistry  BasketBall

In [57]:
pd.merge(df1, df2, on=['Key 1'])

  Key 1 Key 2_x          Course_x  Age  Key 2_y     Course_y      Sport
0    K0      K0      Ibrahim Musa    24      K0      Physics    Football
1    K1      K1        Emeka Jude    25      K0   Statistics  Volleyball
2    K2      K0  Emmanuel Ayomide    27      K0  Mathematics    Swimming
3    K3      K1        Nnamdi Ike    24      K0    Chemistry  BasketBall

In [58]:
pd.merge(df1, df2, on=['Key 1' , 'Key 2'])

  Key 1 Key 2          Course_x  Age      Course_y    Sport
0    K0    K0      Ibrahim Musa    24      Physics  Football
1    K2    K0  Emmanuel Ayomide    27  Mathematics  Swimming

In [60]:
df1

  Key 1 Key 2            Course  Age
0    K0    K0      Ibrahim Musa    24
1    K1    K1        Emeka Jude    25
2    K2    K0  Emmanuel Ayomide    27
3    K3    K1        Nnamdi Ike    24

In [61]:
df2

  Key 1 Key 2       Course      Sport
0    K0    K0      Physics    Football
1    K1    K0   Statistics  Volleyball
2    K2    K0  Mathematics    Swimming
3    K3    K0    Chemistry  BasketBall

In [64]:
pd.merge(df1,df2, how='inner', on=['Key 1', 'Key 2'])

  Key 1 Key 2          Course_x  Age      Course_y    Sport
0    K0    K0      Ibrahim Musa    24      Physics  Football
1    K2    K0  Emmanuel Ayomide    27  Mathematics  Swimming

In [65]:
pd.merge(df1,df2, how='left', on=['Key 1','Key 2'])

  Key 1 Key 2          Course_x  Age      Course_y    Sport
0    K0    K0      Ibrahim Musa    24      Physics  Football
1    K1    K1        Emeka Jude    25          NaN       NaN
2    K2    K0  Emmanuel Ayomide    27  Mathematics  Swimming
3    K3    K1        Nnamdi Ike    24          NaN       NaN

In [66]:
df1

  Key 1 Key 2            Course  Age
0    K0    K0      Ibrahim Musa    24
1    K1    K1        Emeka Jude    25
2    K2    K0  Emmanuel Ayomide    27
3    K3    K1        Nnamdi Ike    24

In [67]:
df2

  Key 1 Key 2       Course      Sport
0    K0    K0      Physics    Football
1    K1    K0   Statistics  Volleyball
2    K2    K0  Mathematics    Swimming
3    K3    K0    Chemistry  BasketBall

In [68]:
pd.merge(df1,df2, how='right', on=['Key 1','Key 2'])

  Key 1 Key 2          Course_x  Age      Course_y      Sport
0    K0    K0      Ibrahim Musa  24.0      Physics    Football
1    K1    K0               NaN   NaN   Statistics  Volleyball
2    K2    K0  Emmanuel Ayomide  27.0  Mathematics    Swimming
3    K3    K0               NaN   NaN    Chemistry  BasketBall